In [1]:
import re
import pandas as pd

data = {'phone_number': ['(123) 456-7890', '123-456-7890', '123.456.7890', '1234567890',
                         '(234) 567-8901', '345-678-9012', '345.678.9012', '4567890123',
                         '(567) 678-9012', '678-901-2345']}

df = pd.DataFrame(data)
df

     phone_number
0  (123) 456-7890
1    123-456-7890
2    123.456.7890
3      1234567890
4  (234) 567-8901
5    345-678-9012
6    345.678.9012
7      4567890123
8  (567) 678-9012
9    678-901-2345

### 1. Assignment : Cleaning data Phone
1. Output yang diharapkan : (123) 456-7890
2. Hilangkan jika tidak ada spasi, ada titik, belum ada () dan lainnya, coba analisa :)

In [3]:
df['new_format'] = df['phone_number'].apply(lambda x: re.sub(r'\D', '', x))

In [5]:
df['new_format'] = df['new_format'].apply(lambda x: f"({x[:3]}) {x[3:6]}-{x[6:]}")

In [7]:
print(df['new_format'])

0    (123) 456-7890
1    (123) 456-7890
2    (123) 456-7890
3    (123) 456-7890
4    (234) 567-8901
5    (345) 678-9012
6    (345) 678-9012
7    (456) 789-0123
8    (567) 678-9012
9    (678) 901-2345
Name: new_format, dtype: object

In [9]:
df

     phone_number      new_format
0  (123) 456-7890  (123) 456-7890
1    123-456-7890  (123) 456-7890
2    123.456.7890  (123) 456-7890
3      1234567890  (123) 456-7890
4  (234) 567-8901  (234) 567-8901
5    345-678-9012  (345) 678-9012
6    345.678.9012  (345) 678-9012
7      4567890123  (456) 789-0123
8  (567) 678-9012  (567) 678-9012
9    678-901-2345  (678) 901-2345

In [60]:
# data teks yang mengandung informasi seperti nama, alamat, nomor telepon, dan email
data = """
Nama: John Doe
Alamat: 123 Main Street, Apt 4B, New York, NY 10001
Nomor Telepon: (555) 555-5555
Email: john.doe@example.com

Nama: Jane Smith
Alamat: 456 Elm Avenue, Los Angeles, CA 90002
Nomor Telepon: (444) 444-4444
Email: jane.smith@example.com

Nama: Ahmad Abdullah
Alamat: Jalan Raya No. 789, Jakarta Selatan, Indonesia
Nomor Telepon: +62 1234 5678
Email: ahmad.abdullah@example.com

Nama: Maria Garcia
Alamat: 789 Oak Street, San Francisco, CA 94101
Nomor Telepon: (333) 333-3333
Email: maria.garcia@example.com

Nama: Alex Kim
Alamat: 567 Pine Road, Chicago, IL 60601
Nomor Telepon: (222) 222-2222
Email: alex.kim@example.com

Nama: Emily Brown
Alamat: 890 Cedar Lane, Houston, TX 77001
Nomor Telepon: (111) 111-1111
Email: emily.brown@example.com

Nama: Michael Johnson
Alamat: 1234 Maple Drive, Miami, FL 33101
Nomor Telepon: (777) 777-7777
Email: michael.johnson@example.com

Nama: Sophie Williams
Alamat: 2345 Birch Street, Boston, MA 02101
Nomor Telepon: (888) 888-8888
Email: sophie.williams@example.com

Nama: David Lee
Alamat: 4566 Willow Lane, Seattle, WA 98101
Nomor Telepon: (999) 999-9999
Email: david.lee@example.com

Nama: Sarah Miller
Alamat: 6789 Cherry Avenue, Dallas, TX 75201
Nomor Telepon: (666) 666-6666
Email: sarah.miller@example.com
"""

In [62]:
data

'\nNama: John Doe\nAlamat: 123 Main Street, Apt 4B, New York, NY 10001\nNomor Telepon: (555) 555-5555\nEmail: john.doe@example.com\n\nNama: Jane Smith\nAlamat: 456 Elm Avenue, Los Angeles, CA 90002\nNomor Telepon: (444) 444-4444\nEmail: jane.smith@example.com\n\nNama: Ahmad Abdullah\nAlamat: Jalan Raya No. 789, Jakarta Selatan, Indonesia\nNomor Telepon: +62 1234 5678\nEmail: ahmad.abdullah@example.com\n\nNama: Maria Garcia\nAlamat: 789 Oak Street, San Francisco, CA 94101\nNomor Telepon: (333) 333-3333\nEmail: maria.garcia@example.com\n\nNama: Alex Kim\nAlamat: 567 Pine Road, Chicago, IL 60601\nNomor Telepon: (222) 222-2222\nEmail: alex.kim@example.com\n\nNama: Emily Brown\nAlamat: 890 Cedar Lane, Houston, TX 77001\nNomor Telepon: (111) 111-1111\nEmail: emily.brown@example.com\n\nNama: Michael Johnson\nAlamat: 1234 Maple Drive, Miami, FL 33101\nNomor Telepon: (777) 777-7777\nEmail: michael.johnson@example.com\n\nNama: Sophie Williams\nAlamat: 2345 Birch Street, Boston, MA 02101\nNomor Telepon: (888) 888-8888\nEmail: sophie.williams@example.com\n\nNama: David Lee\nAlamat: 4566 Willow Lane, Seattle, WA 98101\nNomor Telepon: (999) 999-9999\nEmail: david.lee@example.com\n\nNama: Sarah Miller\nAlamat: 6789 Cherry Avenue, Dallas, TX 75201\nNomor Telepon: (666) 666-6666\nEmail: sarah.miller@example.com\n'

### 2. Data diatas belum clean, coba bersihkan :
1. Buat proses cleaning dan taruh di dataframe dengan kolom baru :
- nama
- alamat
- nomor telepon
- email

In [64]:
from io import StringIO
stringdata = StringIO (data)

In [66]:
pattern = r"Nama: (.*?)\nAlamat: (.*?)\nNomor Telepon: (.*?)\nEmail: (.*?)\n"
matches = re.findall(pattern, data, re.DOTALL)

In [68]:
data = pd.DataFrame(matches, columns=["Nama", "Alamat", "Nomor Telepon", "Email"])

In [70]:
data

,Nama,Alamat,Nomor Telepon,Email
0,John Doe,"123 Main Street, Apt 4B, New York, NY 10001",(555) 555-5555,john.doe@example.com
1,Jane Smith,"456 Elm Avenue, Los Angeles, CA 90002",(444) 444-4444,jane.smith@example.com
2,Ahmad Abdullah,"Jalan Raya No. 789, Jakarta Selatan, Indonesia",+62 1234 5678,ahmad.abdullah@example.com
3,Maria Garcia,"789 Oak Street, San Francisco, CA 94101",(333) 333-3333,maria.garcia@example.com
4,Alex Kim,"567 Pine Road, Chicago, IL 60601",(222) 222-2222,alex.kim@example.com
5,Emily Brown,"890 Cedar Lane, Houston, TX 77001",(111) 111-1111,emily.brown@example.com
6,Michael Johnson,"1234 Maple Drive, Miami, FL 33101",(777) 777-7777,michael.johnson@example.com
7,Sophie Williams,"2345 Birch Street, Boston, MA 02101",(888) 888-8888,sophie.williams@example.com
8,David Lee,"4566 Willow Lane, Seattle, WA 98101",(999) 999-9999,david.lee@example.com
9,Sarah Miller,"6789 Cherry Avenue, Dallas, TX 75201",(666) 666-6666,sarah.miller@example.com

In [74]:
type(data)

pandas.core.frame.DataFrame

In [92]:
data['new_format'] = data['Nomor Telepon'].apply(lambda x: re.sub(r'\D', '', x))

In [94]:
data['new_format'] = data['new_format'].apply(lambda x: f"({x[:3]}) {x[3:6]}-{x[6:]}")

In [96]:
data

,Nama,Alamat,Nomor Telepon,Email,new_format
0,John Doe,"123 Main Street, Apt 4B, New York, NY 10001",(555) 555-5555,john.doe@example.com,(555) 555-5555
1,Jane Smith,"456 Elm Avenue, Los Angeles, CA 90002",(444) 444-4444,jane.smith@example.com,(444) 444-4444
2,Ahmad Abdullah,"Jalan Raya No. 789, Jakarta Selatan, Indonesia",+62 1234 5678,ahmad.abdullah@example.com,(621) 234-5678
3,Maria Garcia,"789 Oak Street, San Francisco, CA 94101",(333) 333-3333,maria.garcia@example.com,(333) 333-3333
4,Alex Kim,"567 Pine Road, Chicago, IL 60601",(222) 222-2222,alex.kim@example.com,(222) 222-2222
5,Emily Brown,"890 Cedar Lane, Houston, TX 77001",(111) 111-1111,emily.brown@example.com,(111) 111-1111
6,Michael Johnson,"1234 Maple Drive, Miami, FL 33101",(777) 777-7777,michael.johnson@example.com,(777) 777-7777
7,Sophie Williams,"2345 Birch Street, Boston, MA 02101",(888) 888-8888,sophie.williams@example.com,(888) 888-8888
8,David Lee,"4566 Willow Lane, Seattle, WA 98101",(999) 999-9999,david.lee@example.com,(999) 999-9999
9,Sarah Miller,"6789 Cherry Avenue, Dallas, TX 75201",(666) 666-6666,sarah.miller@example.com,(666) 666-6666

In [98]:
# Info teks yang tidak terstruktur
data = """
Ini adalah contoh data teks yang berisi alamat email, tetapi terdapat teks tambahan di sekitarnya seperti:
Email saya adalah: example1@example.com, tetapi saya juga punya alamat email lain: sample.email2@example.co.id.
Selain itu, ada beberapa email lain di sini:
- email3@example.com
- email4@example.co.uk
- email5@example
- Ini bukan alamat email
- email6@example.com
- email7@example.co.id
- email8@example.net
- email9@example.com
- email10@example.org
"""

### 3. Lakukan cleaning data diatas dengan 2 cara :
1. regex
2. regex + lambda python
3. Output misalnya : email3@example.com

In [ ]:
#regex

In [100]:
emails = re.findall(r'[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}', data)

In [102]:
emails

['example1@example.com',
 'sample.email2@example.co.id',
 'email3@example.com',
 'email4@example.co.uk',
 'email6@example.com',
 'email7@example.co.id',
 'email8@example.net',
 'email9@example.com',
 'email10@example.org']

In [ ]:
#regex + lambda

In [106]:
df_email = pd.DataFrame({'Email': emails})

In [108]:
df_email['Email'] = df_email['Email'].apply(lambda x: x.strip().lower())

In [110]:
df_email

                         Email
0         example1@example.com
1  sample.email2@example.co.id
2           email3@example.com
3         email4@example.co.uk
4           email6@example.com
5         email7@example.co.id
6           email8@example.net
7           email9@example.com
8          email10@example.org

In [112]:
# Contoh data dengan daftar nama
data = """
Nama: John
Nama: Jane
Ini bukan nama
Nama: Alice
- Nama: Bob
Nama: Carol
Nama: Dave
Tidak ada nama di sini
- Nama: Eve
"""

### 4. Coba ambil nama orang pada data diatas, misal :
1. Nama : John
2. Output : John
3. Ini bukan nama
4. Output : None

In [114]:
data

'\nNama: John\nNama: Jane\nIni bukan nama\nNama: Alice\n- Nama: Bob\nNama: Carol\nNama: Dave\nTidak ada nama di sini\n- Nama: Eve\n'

In [118]:
pattern = r"^Nama:\s+([A-Za-z]+)"
matches = re.findall(pattern, data, re.MULTILINE)

In [120]:
matches

['John', 'Jane', 'Alice', 'Carol', 'Dave']

In [122]:
df = pd.DataFrame(matches, columns=["Nama"])
df

    Nama
0   John
1   Jane
2  Alice
3  Carol
4   Dave